Tekla Open API Reference for Tekla Structures 2025
Size Constructor
Overload List
Name | Description
Size()
 Creates a new size instance with zero width and height.
Size(Double, Double)
 Creates a new size instance with the specified width and height.
Top
See Also
Reference
Size Class
Tekla.Structures.Drawing Namespace